root='./'

user_agents=[
    'Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/39.0.2171.95 Safari/537.36 OPR/26.0.1656.60',
    'Opera/8.0 (Windows NT 5.1; U; en)', 'Mozilla/5.0 (Windows NT 5.1; U; en; rv:1.8.1) Gecko/20061208 Firefox/2.0.0 Opera 9.50',
    'Mozilla/4.0 (compatible; MSIE 6.0; Windows NT 5.1; en) Opera 9.50',
    'Mozilla/5.0 (Windows NT 6.1; WOW64; rv:34.0) Gecko/20100101 Firefox/34.0',
    'Mozilla/5.0 (X11; U; Linux x86_64; zh-CN; rv:1.9.2.10) Gecko/20100922 Ubuntu/10.10 (maverick) Firefox/3.6.10',
    'Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/534.57.2 (KHTML, like Gecko) Version/5.1.7 Safari/534.57.2',
    'Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/39.0.2171.71 Safari/537.36',
    'Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.11 (KHTML, like Gecko) Chrome/23.0.1271.64 Safari/537.11',
    'Mozilla/5.0 (Windows; U; Windows NT 6.1; en-US) AppleWebKit/534.16 (KHTML, like Gecko) Chrome/10.0.648.133 Safari/534.16',
    'Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/30.0.1599.101 Safari/537.36',
    'Mozilla/5.0 (Windows NT 6.1; WOW64; Trident/7.0; rv:11.0) like Gecko',
    'Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/536.11 (KHTML, like Gecko) Chrome/20.0.1132.11 TaoBrowser/2.0 Safari/536.11',
    'Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.1 (KHTML, like Gecko) Chrome/21.0.1180.71 Safari/537.1 LBBROWSER',
    'Mozilla/5.0 (compatible; MSIE 9.0; Windows NT 6.1; WOW64; Trident/5.0; SLCC2; .NET CLR 2.0.50727; .NET CLR 3.5.30729; .NET CLR 3.0.30729; Media Center PC 6.0; .NET4.0C; .NET4.0E; LBBROWSER) ',
    'Mozilla/4.0 (compatible; MSIE 6.0; Windows NT 5.1; SV1; QQDownload 732; .NET4.0C; .NET4.0E; LBBROWSER)"',
    'Mozilla/5.0 (compatible; MSIE 9.0; Windows NT 6.1; WOW64; Trident/5.0; SLCC2; .NET CLR 2.0.50727; .NET CLR 3.5.30729; .NET CLR 3.0.30729; Media Center PC 6.0; .NET4.0C; .NET4.0E; QQBrowser/7.0.3698.400)',
    'Mozilla/4.0 (compatible; MSIE 6.0; Windows NT 5.1; SV1; QQDownload 732; .NET4.0C; .NET4.0E)',
    'Mozilla/5.0 (Windows NT 5.1) AppleWebKit/535.11 (KHTML, like Gecko) Chrome/17.0.963.84 Safari/535.11 SE 2.X MetaSr 1.0',
    'Mozilla/4.0 (compatible; MSIE 7.0; Windows NT 5.1; Trident/4.0; SV1; QQDownload 732; .NET4.0C; .NET4.0E; SE 2.X MetaSr 1.0)',
    'Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Maxthon/4.4.3.4000 Chrome/30.0.1599.101 Safari/537.36',
    'Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/38.0.2125.122 UBrowser/4.0.3214.0 Safari/537.36',
    'Mozilla/5.0 (compatible; MSIE 9.0; Windows NT 6.1; WOW64; Trident/5.0)',
]


# 筛选： 字数：全部 + 写作进度：已完结+ 排序方式：默认+ 作品状态：
# pattern_urls ='//dd[@class="allzplb"]/a'
# pattern_urls_type ='//dd[@class="allzplb"]/a/text()'
# pattern_urls_link ='//dd[@class="allzplb"]/a/@href'
novelsType={
    '都市言情': '/all/book/3_17_0_0_3_0_0_0_1.html',
    '二次元': '/all/book/4_16_0_0_3_0_0_0_1.html',
    '都市小说': '/all/book/2_3_0_0_3_0_0_0_1.html',
    '古装言情': '/all/book/3_5_0_0_3_0_0_0_1.html',
    '情感小说': '/all/book/4_26_0_0_3_0_0_0_1.html',
    '玄幻奇幻': '/all/book/2_21_0_0_3_0_0_0_1.html',
    '悬疑小说': '/all/book/4_7_0_0_3_0_0_0_1.html',
    '青春小说': '/all/book/4_28_0_0_3_0_0_0_1.html',
    '个性化': '/all/book/4_0_0_0_3_0_0_0_1.html',
    '游戏竞技': '/all/book/2_23_0_0_3_0_0_0_1.html',
    '历史军事': '/all/book/2_22_0_0_3_0_0_0_1.html',
    '爆笑小说': '/all/book/4_27_0_0_3_0_0_0_1.html',
    '浪漫青春': '/all/book/3_20_0_0_3_0_0_0_1.html',
    '科幻末世': '/all/book/2_14_0_0_3_0_0_0_1.html',
    '自述小说': '/all/book/4_25_0_0_3_0_0_0_1.html',
    '仙侠武侠': '/all/book/2_24_0_0_3_0_0_0_1.html',
    '男生': '/all/book/2_0_0_0_3_0_0_0_1.html',
    '幻想言情': '/all/book/3_18_0_0_3_0_0_0_1.html',
    '女生': '/all/book/3_0_0_0_3_0_0_0_1.html'
}

novelsSubType={
    '二次元':
        {
            '宅系小说': [116, {'/all/book/4_16_149_0_3_0_0_0_1.html'}],
            '授权同人': [61, {'/all/book/4_16_146_0_3_0_0_0_1.html'}],
            '女生同人': [117, {'/all/book/4_16_142_0_3_0_0_0_1.html'}],
            '萌系小说': [71, {'/all/book/4_16_150_0_3_0_0_0_1.html'}],
            '游戏同人': [177, {'/all/book/4_16_143_0_3_0_0_0_1.html'}],
            '武侠同人': [42, {'/all/book/4_16_147_0_3_0_0_0_1.html'}],
            '动漫同人': [837, {'/all/book/4_16_144_0_3_0_0_0_1.html'}],
            '灵魂转换': [108, {'/all/book/4_16_151_0_3_0_0_0_1.html'}],
            '影视同人': [370, {'/all/book/4_16_145_0_3_0_0_0_1.html'}]
        },
    '女生':
        {
            '百合之恋': [54, {'/all/book/3_20_141_0_3_0_0_0_1.html'}],
            '架空历史': [466, {'/all/book/3_5_133_0_3_0_0_0_1.html'}],
            '青青校园': [1109, {'/all/book/3_17_17_0_3_0_0_0_1.html'}],
            '家宅恩怨': [129, {'/all/book/3_5_7_0_3_0_0_0_1.html'}],
            '穿越时空': [912, {'/all/book/3_5_22_0_3_0_0_0_1.html'}],
            '快意江湖': [287, {'/all/book/3_5_132_0_3_0_0_0_1.html'}],
            '唯美纯爱': [1193, {'/all/book/3_20_19_0_3_0_0_0_1.html'}],
            '游戏情缘': [82, {'/all/book/3_17_135_0_3_0_0_0_1.html'}],
            '跨国情缘': [8, {'/all/book/3_17_169_0_3_0_0_0_1.html'}],
            '婚恋爱情': [650, {'/all/book/3_17_26_0_3_0_0_0_1.html'}],
            '网配快穿': [44, {'/all/book/3_20_148_0_3_0_0_0_1.html'}],
            '玄幻仙侠': [650, {'/all/book/3_18_137_0_3_0_0_0_1.html'}],
            '娱乐明星': [96, {'/all/book/3_17_167_0_3_0_0_0_1.html'}],
            '现代重生': [95, {'/all/book/3_17_166_0_3_0_0_0_1.html'}],
            '总裁豪门': [800, {'/all/book/3_17_134_0_3_0_0_0_1.html'}],
            '星际科幻': [55, {'/all/book/3_18_170_0_3_0_0_0_1.html'}],
            '职场丽人': [200, {'/all/book/3_17_16_0_3_0_0_0_1.html'}],
            '灵异悬疑': [440, {'/all/book/3_18_24_0_3_0_0_0_1.html'}],
            '西方奇幻': [42, {'/all/book/3_18_173_0_3_0_0_0_1.html'}],
            '民国旧影': [24, {'/all/book/3_17_168_0_3_0_0_0_1.html'}],
            '宫廷贵族': [865, {'/all/book/3_5_10_0_3_0_0_0_1.html'}],
            '都市情缘': [541, {'/all/book/3_17_136_0_3_0_0_0_1.html'}],
            '末世危机': [29, {'/all/book/3_18_171_0_3_0_0_0_1.html'}],
            '经商种田': [75, {'/all/book/3_5_165_0_3_0_0_0_1.html'}],
            '前世今生': [275, {'/all/book/3_5_140_0_3_0_0_0_1.html'}],
            '异能空间': [97, {'/all/book/3_18_172_0_3_0_0_0_1.html'}],
            '异界魔法': [269, {'/all/book/3_18_138_0_3_0_0_0_1.html'}],
            '古代重生': [513, {'/all/book/3_5_139_0_3_0_0_0_1.html'}]
        },
    '青春小说':
        {
            '纯爱青春': [395, {'/all/book/4_28_162_0_3_0_0_0_1.html'}],
            '校园青春': [1196, {'/all/book/4_28_161_0_3_0_0_0_1.html'}],
            '悲伤青春': [444, {'/all/book/4_28_163_0_3_0_0_0_1.html'}]
        },
    '浪漫青春':
        {
            '唯美纯爱': [2729, {'/all/book/3_20_19_0_3_0_0_0_1.html'}],
            '百合之恋': [118, {'/all/book/3_20_141_0_3_0_0_0_1.html'}],
            '网配快穿': [108, {'/all/book/3_20_148_0_3_0_0_0_1.html'}]
        },
    '玄幻奇幻':
        {
            '领主贵族': [83, {'/all/book/2_21_123_0_3_0_0_0_1.html'}],
            '异术超能': [584, {'/all/book/2_21_84_0_3_0_0_0_1.html'}],
            '魔法校园': [181, {'/all/book/2_21_122_0_3_0_0_0_1.html'}],
            '异世争霸': [304, {'/all/book/2_21_115_0_3_0_0_0_1.html'}],
            '西方奇幻': [1025, {'/all/book/2_21_1_0_3_0_0_0_1.html'}],
            '东方玄幻': [4204, {'/all/book/2_21_8_0_3_0_0_0_1.html'}],
            '异界大陆': [3619, {'/all/book/2_21_83_0_3_0_0_0_1.html'}]
        },
    '历史军事':
        {
            '历史传奇': [290, {'/all/book/2_22_120_0_3_0_0_0_1.html'}],
            '战争幻想': [158, {'/all/book/2_22_11_0_3_0_0_0_1.html'}],
            '战史风云': [77, {'/all/book/2_22_126_0_3_0_0_0_1.html'}],
            '架空历史': [512, {'/all/book/2_22_93_0_3_0_0_0_1.html'}],
            '历史穿越': [629, {'/all/book/2_22_4_0_3_0_0_0_1.html'}],
            '军旅生涯': [205, {'/all/book/2_22_94_0_3_0_0_0_1.html'}],
            '谍战特工': [60, {'/all/book/2_22_127_0_3_0_0_0_1.html'}]
        },
    '自述小说':
        {
            '另类视角': [215, {'/all/book/4_25_154_0_3_0_0_0_1.html'}],
            '现实经历': [442, {'/all/book/4_25_153_0_3_0_0_0_1.html'}],
            '臆想世界': [343, {'/all/book/4_25_152_0_3_0_0_0_1.html'}]
        },
    '爆笑小说':
        {
            '现实爆笑': [58, {'/all/book/4_27_159_0_3_0_0_0_1.html'}],
            '幻想爆笑': [165, {'/all/book/4_27_158_0_3_0_0_0_1.html'}],
            '冷幽默': [27, {'/all/book/4_27_160_0_3_0_0_0_1.html'}]
        },
    '情感小说':
        {
            '婆媳关系': [5, {'/all/book/4_26_155_0_3_0_0_0_1.html'}],
            '婚恋情感': [1299, {'/all/book/4_26_88_0_3_0_0_0_1.html'}],
            '家庭伦理': [92, {'/all/book/4_26_157_0_3_0_0_0_1.html'}]
        },
    '古装言情':
        {
            '穿越时空': [2080, {'/all/book/3_5_22_0_3_0_0_0_1.html'}],
            '架空历史': [1019, {'/all/book/3_5_133_0_3_0_0_0_1.html'}],
            '前世今生': [627, {'/all/book/3_5_140_0_3_0_0_0_1.html'}],
            '家宅恩怨': [317, {'/all/book/3_5_7_0_3_0_0_0_1.html'}],
            '快意江湖': [721, {'/all/book/3_5_132_0_3_0_0_0_1.html'}],
            '经商种田': [120, {'/all/book/3_5_165_0_3_0_0_0_1.html'}],
            '古代重生': [1186, {'/all/book/3_5_139_0_3_0_0_0_1.html'}],
            '宫廷贵族': [1966, {'/all/book/3_5_10_0_3_0_0_0_1.html'}]
        },
    '游戏竞技':
        {
            '电子竞技': [122, {'/all/book/2_23_12_0_3_0_0_0_1.html'}],
            '篮球风云': [39, {'/all/book/2_23_97_0_3_0_0_0_1.html'}],
            '天下足球': [37, {'/all/book/2_23_98_0_3_0_0_0_1.html'}],
            '棋牌桌游': [9, {'/all/book/2_23_99_0_3_0_0_0_1.html'}],
            '游戏生涯': [1030, {'/all/book/2_23_14_0_3_0_0_0_1.html'}],
            '体育竞技': [18, {'/all/book/2_23_100_0_3_0_0_0_1.html'}],
            '虚拟网游': [862, {'/all/book/2_23_5_0_3_0_0_0_1.html'}],
            '游戏异界': [266, {'/all/book/2_23_121_0_3_0_0_0_1.html'}]
        },
    '悬疑小说':
        {
            '探险揭秘': [348, {'/all/book/4_7_102_0_3_0_0_0_1.html'}],
            '恐怖悬疑': [609, {'/all/book/4_7_28_0_3_0_0_0_1.html'}],
            '侦探推理': [408, {'/all/book/4_7_33_0_3_0_0_0_1.html'}],
            '灵异奇谈': [981, {'/all/book/4_7_13_0_3_0_0_0_1.html'}]
        },
    '科幻末世':
        {
            '星际战争': [155, {'/all/book/2_14_95_0_3_0_0_0_1.html'}],
            '末世危机': [534, {'/all/book/2_14_128_0_3_0_0_0_1.html'}],
            '进化变异': [213, {'/all/book/2_14_129_0_3_0_0_0_1.html'}],
            '未来幻想': [723, {'/all/book/2_14_6_0_3_0_0_0_1.html'}],
            '古武机甲': [61, {'/all/book/2_14_131_0_3_0_0_0_1.html'}],
            '时空穿梭': [264, {'/all/book/2_14_130_0_3_0_0_0_1.html'}]},
    '都市言情':
        {
            '总裁豪门': [1873, {'/all/book/3_17_134_0_3_0_0_0_1.html'}],
            '职场丽人': [491, {'/all/book/3_17_16_0_3_0_0_0_1.html'}],
            '青青校园': [2501, {'/all/book/3_17_17_0_3_0_0_0_1.html'}],
            '婚恋爱情': [1444, {'/all/book/3_17_26_0_3_0_0_0_1.html'}],
            '都市情缘': [1351, {'/all/book/3_17_136_0_3_0_0_0_1.html'}],
            '游戏情缘': [155, {'/all/book/3_17_135_0_3_0_0_0_1.html'}],
            '民国旧影': [62, {'/all/book/3_17_168_0_3_0_0_0_1.html'}],
            '跨国情缘': [22, {'/all/book/3_17_169_0_3_0_0_0_1.html'}],
            '娱乐明星': [265, {'/all/book/3_17_167_0_3_0_0_0_1.html'}],
            '现代重生': [223, {'/all/book/3_17_166_0_3_0_0_0_1.html'}]
        },
    '男生':
        {
            '奇幻修真': [327, {'/all/book/2_24_82_0_3_0_0_0_1.html'}],
            '古典仙侠': [525, {'/all/book/2_24_9_0_3_0_0_0_1.html'}],
            '篮球风云': [10, {'/all/book/2_23_97_0_3_0_0_0_1.html'}],
            '架空历史': [169, {'/all/book/2_22_93_0_3_0_0_0_1.html'}],
            '现代修真': [143, {'/all/book/2_24_81_0_3_0_0_0_1.html'}],
            '都市生活': [860, {'/all/book/2_3_3_0_3_0_0_0_1.html'}],
            '热血青春': [359, {'/all/book/2_3_86_0_3_0_0_0_1.html'}],
            '商业大亨': [24, {'/all/book/2_3_117_0_3_0_0_0_1.html'}],
            '历史武侠': [50, {'/all/book/2_24_124_0_3_0_0_0_1.html'}],
            '谍战特工': [23, {'/all/book/2_22_127_0_3_0_0_0_1.html'}],
            '异世争霸': [116, {'/all/book/2_21_115_0_3_0_0_0_1.html'}],
            '军旅生涯': [61, {'/all/book/2_22_94_0_3_0_0_0_1.html'}],
            '职场励志': [33, {'/all/book/2_3_90_0_3_0_0_0_1.html'}],
            '虚拟网游': [278, {'/all/book/2_23_5_0_3_0_0_0_1.html'}],
            '国术古武': [13, {'/all/book/2_24_125_0_3_0_0_0_1.html'}],
            '战史风云': [25, {'/all/book/2_22_126_0_3_0_0_0_1.html'}],
            '传统武侠': [397, {'/all/book/2_24_2_0_3_0_0_0_1.html'}],
            '都市重生': [120, {'/all/book/2_3_89_0_3_0_0_0_1.html'}],
            '现代异侠': [20, {'/all/book/2_24_96_0_3_0_0_0_1.html'}],
            '东方玄幻': [1693, {'/all/book/2_21_8_0_3_0_0_0_1.html'}],
            '游戏异界': [83, {'/all/book/2_23_121_0_3_0_0_0_1.html'}],
            '末世危机': [195, {'/all/book/2_14_128_0_3_0_0_0_1.html'}],
            '体育竞技': [1, {'/all/book/2_23_100_0_3_0_0_0_1.html'}],
            '异术超能': [257, {'/all/book/2_21_84_0_3_0_0_0_1.html'}],
            '棋牌桌游': [5, {'/all/book/2_23_99_0_3_0_0_0_1.html'}],
            '都市异能': [518, {'/all/book/2_3_87_0_3_0_0_0_1.html'}],
            '战争幻想': [37, {'/all/book/2_22_11_0_3_0_0_0_1.html'}],
            '魔法校园': [75, {'/all/book/2_21_122_0_3_0_0_0_1.html'}],
            '校园风云': [242, {'/all/book/2_3_118_0_3_0_0_0_1.html'}],
            '进化变异': [69, {'/all/book/2_14_129_0_3_0_0_0_1.html'}],
            '古武机甲': [17, {'/all/book/2_14_131_0_3_0_0_0_1.html'}],
            '异界大陆': [1412, {'/all/book/2_21_83_0_3_0_0_0_1.html'}],
            '时空穿梭': [87, {'/all/book/2_14_130_0_3_0_0_0_1.html'}],
            '历史传奇': [74, {'/all/book/2_22_120_0_3_0_0_0_1.html'}],
            '星际战争': [39, {'/all/book/2_14_95_0_3_0_0_0_1.html'}],
            '游戏生涯': [338, {'/all/book/2_23_14_0_3_0_0_0_1.html'}],
            '娱乐明星': [54, {'/all/book/2_3_116_0_3_0_0_0_1.html'}],
            '电子竞技': [42, {'/all/book/2_23_12_0_3_0_0_0_1.html'}],
            '天下足球': [10, {'/all/book/2_23_98_0_3_0_0_0_1.html'}],
            '未来幻想': [250, {'/all/book/2_14_6_0_3_0_0_0_1.html'}],
            '都市激战': [207, {'/all/book/2_3_92_0_3_0_0_0_1.html'}],
            '领主贵族': [27, {'/all/book/2_21_123_0_3_0_0_0_1.html'}],
            '乡村乡土': [56, {'/all/book/2_3_119_0_3_0_0_0_1.html'}],
            '现实题材': [6, {'/all/book/2_3_91_0_3_0_0_0_1.html'}],
            '历史穿越': [211, {'/all/book/2_22_4_0_3_0_0_0_1.html'}],
            '洪荒封神': [75, {'/all/book/2_24_85_0_3_0_0_0_1.html'}],
            '西方奇幻': [367, {'/all/book/2_21_1_0_3_0_0_0_1.html'}]
        },
    '幻想言情':
        {
            '星际科幻': [157, {'/all/book/3_18_170_0_3_0_0_0_1.html'}],
            '异界魔法': [674, {'/all/book/3_18_138_0_3_0_0_0_1.html'}],
            '异能空间': [186, {'/all/book/3_18_172_0_3_0_0_0_1.html'}],
            '西方奇幻': [105, {'/all/book/3_18_173_0_3_0_0_0_1.html'}],
            '灵异悬疑': [1072, {'/all/book/3_18_24_0_3_0_0_0_1.html'}],
            '玄幻仙侠': [1550, {'/all/book/3_18_137_0_3_0_0_0_1.html'}],
            '末世危机': [50, {'/all/book/3_18_171_0_3_0_0_0_1.html'}]
        },
    '都市小说':
        {
            '职场励志': [88, {'/all/book/2_3_90_0_3_0_0_0_1.html'}],
            '现实题材': [37, {'/all/book/2_3_91_0_3_0_0_0_1.html'}],
            '热血青春': [1077, {'/all/book/2_3_86_0_3_0_0_0_1.html'}],
            '校园风云': [716, {'/all/book/2_3_118_0_3_0_0_0_1.html'}],
            '乡村乡土': [163, {'/all/book/2_3_119_0_3_0_0_0_1.html'}],
            '都市激战': [625, {'/all/book/2_3_92_0_3_0_0_0_1.html'}],
            '商业大亨': [69, {'/all/book/2_3_117_0_3_0_0_0_1.html'}],
            '娱乐明星': [138, {'/all/book/2_3_116_0_3_0_0_0_1.html'}],
            '都市生活': [2281, {'/all/book/2_3_3_0_3_0_0_0_1.html'}],
            '都市异能': [1598, {'/all/book/2_3_87_0_3_0_0_0_1.html'}],
            '都市重生': [345, {'/all/book/2_3_89_0_3_0_0_0_1.html'}]
        },
    '个性化':
        {
            '另类视角': [208, {'/all/book/4_25_154_0_3_0_0_0_1.html'}],
            '武侠同人': [48, {'/all/book/4_16_147_0_3_0_0_0_1.html'}],
            '女生同人': [112, {'/all/book/4_16_142_0_3_0_0_0_1.html'}],
            '萌系小说': [82, {'/all/book/4_16_150_0_3_0_0_0_1.html'}],
            '婆媳关系': [3, {'/all/book/4_26_155_0_3_0_0_0_1.html'}],
            '灵魂转换': [88, {'/all/book/4_16_151_0_3_0_0_0_1.html'}],
            '婚恋情感': [1287, {'/all/book/4_26_88_0_3_0_0_0_1.html'}],
            '授权同人': [63, {'/all/book/4_16_146_0_3_0_0_0_1.html'}],
            '校园青春': [1222, {'/all/book/4_28_161_0_3_0_0_0_1.html'}],
            '游戏同人': [163, {'/all/book/4_16_143_0_3_0_0_0_1.html'}],
            '宅系小说': [130, {'/all/book/4_16_149_0_3_0_0_0_1.html'}],
            '幻想爆笑': [164, {'/all/book/4_27_158_0_3_0_0_0_1.html'}],
            '现实经历': [463, {'/all/book/4_25_153_0_3_0_0_0_1.html'}],
            '纯爱青春': [387, {'/all/book/4_28_162_0_3_0_0_0_1.html'}],
            '现实爆笑': [64, {'/all/book/4_27_159_0_3_0_0_0_1.html'}],
            '家庭伦理': [92, {'/all/book/4_26_157_0_3_0_0_0_1.html'}],
            '灵异奇谈': [993, {'/all/book/4_7_13_0_3_0_0_0_1.html'}],
            '动漫同人': [842, {'/all/book/4_16_144_0_3_0_0_0_1.html'}],
            '臆想世界': [313, {'/all/book/4_25_152_0_3_0_0_0_1.html'}],
            '侦探推理': [422, {'/all/book/4_7_33_0_3_0_0_0_1.html'}],
            '冷幽默': [28, {'/all/book/4_27_160_0_3_0_0_0_1.html'}],
            '探险揭秘': [360, {'/all/book/4_7_102_0_3_0_0_0_1.html'}],
            '悲伤青春': [448, {'/all/book/4_28_163_0_3_0_0_0_1.html'}],
            '恐怖悬疑': [617, {'/all/book/4_7_28_0_3_0_0_0_1.html'}],
            '影视同人': [354, {'/all/book/4_16_145_0_3_0_0_0_1.html'}]
        },
    '仙侠武侠':
        {
            '历史武侠': [136, {'/all/book/2_24_124_0_3_0_0_0_1.html'}],
            '古典仙侠': [1448, {'/all/book/2_24_9_0_3_0_0_0_1.html'}],
            '国术古武': [33, {'/all/book/2_24_125_0_3_0_0_0_1.html'}],
            '现代修真': [400, {'/all/book/2_24_81_0_3_0_0_0_1.html'}],
            '现代异侠': [64, {'/all/book/2_24_96_0_3_0_0_0_1.html'}],
            '传统武侠': [1073, {'/all/book/2_24_2_0_3_0_0_0_1.html'}],
            '洪荒封神': [208, {'/all/book/2_24_85_0_3_0_0_0_1.html'}],
            '奇幻修真': [995, {'/all/book/2_24_82_0_3_0_0_0_1.html'}]
        }
}

{'二次元': {'宅系小说': [116, {'/all/book/4_16_149_0_3_0_0_0_1.html'}], '授权同人': [61, {'/all/book/4_16_146_0_3_0_0_0_1.html'}], '女生同人': [117, {'/all/book/4_16_142_0_3_0_0_0_1.html'}], '萌系小说': [71, {'/all/book/4_16_150_0_3_0_0_0_1.html'}], '游戏同人': [177, {'/all/book/4_16_143_0_3_0_0_0_1.html'}], '武侠同人': [42, {'/all/book/4_16_147_0_3_0_0_0_1.html'}], '动漫同人': [837, {'/all/book/4_16_144_0_3_0_0_0_1.html'}], '灵魂转换': [108, {'/all/book/4_16_151_0_3_0_0_0_1.html'}], '影视同人': [370, {'/all/book/4_16_145_0_3_0_0_0_1.html'}]}, '女生': {'百合之恋': [54, {'/all/book/3_20_141_0_3_0_0_0_1.html'}], '架空历史': [466, {'/all/book/3_5_133_0_3_0_0_0_1.html'}], '青青校园': [1109, {'/all/book/3_17_17_0_3_0_0_0_1.html'}], '家宅恩怨': [129, {'/all/book/3_5_7_0_3_0_0_0_1.html'}], '穿越时空': [912, {'/all/book/3_5_22_0_3_0_0_0_1.html'}], '快意江湖': [287, {'/all/book/3_5_132_0_3_0_0_0_1.html'}], '唯美纯爱': [1193, {'/all/book/3_20_19_0_3_0_0_0_1.html'}], '游戏情缘': [82, {'/all/book/3_17_135_0_3_0_0_0_1.html'}], '跨国情缘': [8, {'/all/book/3_17_169_0_3_0_0_0_1.html'}], '婚恋爱情': [650, {'/all/book/3_17_26_0_3_0_0_0_1.html'}], '网配快穿': [44, {'/all/book/3_20_148_0_3_0_0_0_1.html'}], '玄幻仙侠': [650, {'/all/book/3_18_137_0_3_0_0_0_1.html'}], '娱乐明星': [96, {'/all/book/3_17_167_0_3_0_0_0_1.html'}], '现代重生': [95, {'/all/book/3_17_166_0_3_0_0_0_1.html'}], '总裁豪门': [800, {'/all/book/3_17_134_0_3_0_0_0_1.html'}], '星际科幻': [55, {'/all/book/3_18_170_0_3_0_0_0_1.html'}], '职场丽人': [200, {'/all/book/3_17_16_0_3_0_0_0_1.html'}], '灵异悬疑': [440, {'/all/book/3_18_24_0_3_0_0_0_1.html'}], '西方奇幻': [42, {'/all/book/3_18_173_0_3_0_0_0_1.html'}], '民国旧影': [24, {'/all/book/3_17_168_0_3_0_0_0_1.html'}], '宫廷贵族': [865, {'/all/book/3_5_10_0_3_0_0_0_1.html'}], '都市情缘': [541, {'/all/book/3_17_136_0_3_0_0_0_1.html'}], '末世危机': [29, {'/all/book/3_18_171_0_3_0_0_0_1.html'}], '经商种田': [75, {'/all/book/3_5_165_0_3_0_0_0_1.html'}], '前世今生': [275, {'/all/book/3_5_140_0_3_0_0_0_1.html'}], '异能空间': [97, {'/all/book/3_18_172_0_3_0_0_0_1.html'}], '异界魔法': [269, {'/all/book/3_18_138_0_3_0_0_0_1.html'}], '古代重生': [513, {'/all/book/3_5_139_0_3_0_0_0_1.html'}]}, '青春小说': {'纯爱青春': [395, {'/all/book/4_28_162_0_3_0_0_0_1.html'}], '校园青春': [1196, {'/all/book/4_28_161_0_3_0_0_0_1.html'}], '悲伤青春': [444, {'/all/book/4_28_163_0_3_0_0_0_1.html'}]}, '浪漫青春': {'唯美纯爱': [2729, {'/all/book/3_20_19_0_3_0_0_0_1.html'}], '百合之恋': [118, {'/all/book/3_20_141_0_3_0_0_0_1.html'}], '网配快穿': [108, {'/all/book/3_20_148_0_3_0_0_0_1.html'}]}, '玄幻奇幻': {'领主贵族': [83, {'/all/book/2_21_123_0_3_0_0_0_1.html'}], '异术超能': [584, {'/all/book/2_21_84_0_3_0_0_0_1.html'}], '魔法校园': [181, {'/all/book/2_21_122_0_3_0_0_0_1.html'}], '异世争霸': [304, {'/all/book/2_21_115_0_3_0_0_0_1.html'}], '西方奇幻': [1025, {'/all/book/2_21_1_0_3_0_0_0_1.html'}], '东方玄幻': [4204, {'/all/book/2_21_8_0_3_0_0_0_1.html'}], '异界大陆': [3619, {'/all/book/2_21_83_0_3_0_0_0_1.html'}]}, '历史军事': {'历史传奇': [290, {'/all/book/2_22_120_0_3_0_0_0_1.html'}], '战争幻想': [158, {'/all/book/2_22_11_0_3_0_0_0_1.html'}], '战史风云': [77, {'/all/book/2_22_126_0_3_0_0_0_1.html'}], '架空历史': [512, {'/all/book/2_22_93_0_3_0_0_0_1.html'}], '历史穿越': [629, {'/all/book/2_22_4_0_3_0_0_0_1.html'}], '军旅生涯': [205, {'/all/book/2_22_94_0_3_0_0_0_1.html'}], '谍战特工': [60, {'/all/book/2_22_127_0_3_0_0_0_1.html'}]}, '自述小说': {'另类视角': [215, {'/all/book/4_25_154_0_3_0_0_0_1.html'}], '现实经历': [442, {'/all/book/4_25_153_0_3_0_0_0_1.html'}], '臆想世界': [343, {'/all/book/4_25_152_0_3_0_0_0_1.html'}]}, '爆笑小说': {'现实爆笑': [58, {'/all/book/4_27_159_0_3_0_0_0_1.html'}], '幻想爆笑': [165, {'/all/book/4_27_158_0_3_0_0_0_1.html'}], '冷幽默': [27, {'/all/book/4_27_160_0_3_0_0_0_1.html'}]}, '情感小说': {'婆媳关系': [5, {'/all/book/4_26_155_0_3_0_0_0_1.html'}], '婚恋情感': [1299, {'/all/book/4_26_88_0_3_0_0_0_1.html'}], '家庭伦理': [92, {'/all/book/4_26_157_0_3_0_0_0_1.html'}]}, '古装言情': {'穿越时空': [2080, {'/all/book/3_5_22_0_3_0_0_0_1.html'}], '架空历史': [1019, {'/all/book/3_5_133_0_3_0_0_0_1.html'}], '前世今生': [627, {'/all/book/3_5_140_0_3_0_0_0_1.html'}], '家宅恩怨': [317, {'/all/book/3_5_7_0_3_0_0_0_1.html'}], '快意江湖': [721, {'/all/book/3_5_132_0_3_0_0_0_1.html'}], '经商种田': [120, {'/all/book/3_5_165_0_3_0_0_0_1.html'}], '古代重生': [1186, {'/all/book/3_5_139_0_3_0_0_0_1.html'}], '宫廷贵族': [1966, {'/all/book/3_5_10_0_3_0_0_0_1.html'}]}, '游戏竞技': {'电子竞技': [122, {'/all/book/2_23_12_0_3_0_0_0_1.html'}], '篮球风云': [39, {'/all/book/2_23_97_0_3_0_0_0_1.html'}], '天下足球': [37, {'/all/book/2_23_98_0_3_0_0_0_1.html'}], '棋牌桌游': [9, {'/all/book/2_23_99_0_3_0_0_0_1.html'}], '游戏生涯': [1030, {'/all/book/2_23_14_0_3_0_0_0_1.html'}], '体育竞技': [18, {'/all/book/2_23_100_0_3_0_0_0_1.html'}], '虚拟网游': [862, {'/all/book/2_23_5_0_3_0_0_0_1.html'}], '游戏异界': [266, {'/all/book/2_23_121_0_3_0_0_0_1.html'}]}, '悬疑小说': {'探险揭秘': [348, {'/all/book/4_7_102_0_3_0_0_0_1.html'}], '恐怖悬疑': [609, {'/all/book/4_7_28_0_3_0_0_0_1.html'}], '侦探推理': [408, {'/all/book/4_7_33_0_3_0_0_0_1.html'}], '灵异奇谈': [981, {'/all/book/4_7_13_0_3_0_0_0_1.html'}]}, '科幻末世': {'星际战争': [155, {'/all/book/2_14_95_0_3_0_0_0_1.html'}], '末世危机': [534, {'/all/book/2_14_128_0_3_0_0_0_1.html'}], '进化变异': [213, {'/all/book/2_14_129_0_3_0_0_0_1.html'}], '未来幻想': [723, {'/all/book/2_14_6_0_3_0_0_0_1.html'}], '古武机甲': [61, {'/all/book/2_14_131_0_3_0_0_0_1.html'}], '时空穿梭': [264, {'/all/book/2_14_130_0_3_0_0_0_1.html'}]}, '都市言情': {'总裁豪门': [1873, {'/all/book/3_17_134_0_3_0_0_0_1.html'}], '职场丽人': [491, {'/all/book/3_17_16_0_3_0_0_0_1.html'}], '青青校园': [2501, {'/all/book/3_17_17_0_3_0_0_0_1.html'}], '婚恋爱情': [1444, {'/all/book/3_17_26_0_3_0_0_0_1.html'}], '都市情缘': [1351, {'/all/book/3_17_136_0_3_0_0_0_1.html'}], '游戏情缘': [155, {'/all/book/3_17_135_0_3_0_0_0_1.html'}], '民国旧影': [62, {'/all/book/3_17_168_0_3_0_0_0_1.html'}], '跨国情缘': [22, {'/all/book/3_17_169_0_3_0_0_0_1.html'}], '娱乐明星': [265, {'/all/book/3_17_167_0_3_0_0_0_1.html'}], '现代重生': [223, {'/all/book/3_17_166_0_3_0_0_0_1.html'}]}, '男生': {'奇幻修真': [327, {'/all/book/2_24_82_0_3_0_0_0_1.html'}], '古典仙侠': [525, {'/all/book/2_24_9_0_3_0_0_0_1.html'}], '篮球风云': [10, {'/all/book/2_23_97_0_3_0_0_0_1.html'}], '架空历史': [169, {'/all/book/2_22_93_0_3_0_0_0_1.html'}], '现代修真': [143, {'/all/book/2_24_81_0_3_0_0_0_1.html'}], '都市生活': [860, {'/all/book/2_3_3_0_3_0_0_0_1.html'}], '热血青春': [359, {'/all/book/2_3_86_0_3_0_0_0_1.html'}], '商业大亨': [24, {'/all/book/2_3_117_0_3_0_0_0_1.html'}], '历史武侠': [50, {'/all/book/2_24_124_0_3_0_0_0_1.html'}], '谍战特工': [23, {'/all/book/2_22_127_0_3_0_0_0_1.html'}], '异世争霸': [116, {'/all/book/2_21_115_0_3_0_0_0_1.html'}], '军旅生涯': [61, {'/all/book/2_22_94_0_3_0_0_0_1.html'}], '职场励志': [33, {'/all/book/2_3_90_0_3_0_0_0_1.html'}], '虚拟网游': [278, {'/all/book/2_23_5_0_3_0_0_0_1.html'}], '国术古武': [13, {'/all/book/2_24_125_0_3_0_0_0_1.html'}], '战史风云': [25, {'/all/book/2_22_126_0_3_0_0_0_1.html'}], '传统武侠': [397, {'/all/book/2_24_2_0_3_0_0_0_1.html'}], '都市重生': [120, {'/all/book/2_3_89_0_3_0_0_0_1.html'}], '现代异侠': [20, {'/all/book/2_24_96_0_3_0_0_0_1.html'}], '东方玄幻': [1693, {'/all/book/2_21_8_0_3_0_0_0_1.html'}], '游戏异界': [83, {'/all/book/2_23_121_0_3_0_0_0_1.html'}], '末世危机': [195, {'/all/book/2_14_128_0_3_0_0_0_1.html'}], '体育竞技': [1, {'/all/book/2_23_100_0_3_0_0_0_1.html'}], '异术超能': [257, {'/all/book/2_21_84_0_3_0_0_0_1.html'}], '棋牌桌游': [5, {'/all/book/2_23_99_0_3_0_0_0_1.html'}], '都市异能': [518, {'/all/book/2_3_87_0_3_0_0_0_1.html'}], '战争幻想': [37, {'/all/book/2_22_11_0_3_0_0_0_1.html'}], '魔法校园': [75, {'/all/book/2_21_122_0_3_0_0_0_1.html'}], '校园风云': [242, {'/all/book/2_3_118_0_3_0_0_0_1.html'}], '进化变异': [69, {'/all/book/2_14_129_0_3_0_0_0_1.html'}], '古武机甲': [17, {'/all/book/2_14_131_0_3_0_0_0_1.html'}], '异界大陆': [1412, {'/all/book/2_21_83_0_3_0_0_0_1.html'}], '时空穿梭': [87, {'/all/book/2_14_130_0_3_0_0_0_1.html'}], '历史传奇': [74, {'/all/book/2_22_120_0_3_0_0_0_1.html'}], '星际战争': [39, {'/all/book/2_14_95_0_3_0_0_0_1.html'}], '游戏生涯': [338, {'/all/book/2_23_14_0_3_0_0_0_1.html'}], '娱乐明星': [54, {'/all/book/2_3_116_0_3_0_0_0_1.html'}], '电子竞技': [42, {'/all/book/2_23_12_0_3_0_0_0_1.html'}], '天下足球': [10, {'/all/book/2_23_98_0_3_0_0_0_1.html'}], '未来幻想': [250, {'/all/book/2_14_6_0_3_0_0_0_1.html'}], '都市激战': [207, {'/all/book/2_3_92_0_3_0_0_0_1.html'}], '领主贵族': [27, {'/all/book/2_21_123_0_3_0_0_0_1.html'}], '乡村乡土': [56, {'/all/book/2_3_119_0_3_0_0_0_1.html'}], '现实题材': [6, {'/all/book/2_3_91_0_3_0_0_0_1.html'}], '历史穿越': [211, {'/all/book/2_22_4_0_3_0_0_0_1.html'}], '洪荒封神': [75, {'/all/book/2_24_85_0_3_0_0_0_1.html'}], '西方奇幻': [367, {'/all/book/2_21_1_0_3_0_0_0_1.html'}]}, '幻想言情': {'星际科幻': [157, {'/all/book/3_18_170_0_3_0_0_0_1.html'}], '异界魔法': [674, {'/all/book/3_18_138_0_3_0_0_0_1.html'}], '异能空间': [186, {'/all/book/3_18_172_0_3_0_0_0_1.html'}], '西方奇幻': [105, {'/all/book/3_18_173_0_3_0_0_0_1.html'}], '灵异悬疑': [1072, {'/all/book/3_18_24_0_3_0_0_0_1.html'}], '玄幻仙侠': [1550, {'/all/book/3_18_137_0_3_0_0_0_1.html'}], '末世危机': [50, {'/all/book/3_18_171_0_3_0_0_0_1.html'}]}, '都市小说': {'职场励志': [88, {'/all/book/2_3_90_0_3_0_0_0_1.html'}], '现实题材': [37, {'/all/book/2_3_91_0_3_0_0_0_1.html'}], '热血青春': [1077, {'/all/book/2_3_86_0_3_0_0_0_1.html'}], '校园风云': [716, {'/all/book/2_3_118_0_3_0_0_0_1.html'}], '乡村乡土': [163, {'/all/book/2_3_119_0_3_0_0_0_1.html'}], '都市激战': [625, {'/all/book/2_3_92_0_3_0_0_0_1.html'}], '商业大亨': [69, {'/all/book/2_3_117_0_3_0_0_0_1.html'}], '娱乐明星': [138, {'/all/book/2_3_116_0_3_0_0_0_1.html'}], '都市生活': [2281, {'/all/book/2_3_3_0_3_0_0_0_1.html'}], '都市异能': [1598, {'/all/book/2_3_87_0_3_0_0_0_1.html'}], '都市重生': [345, {'/all/book/2_3_89_0_3_0_0_0_1.html'}]}, '个性化': {'另类视角': [208, {'/all/book/4_25_154_0_3_0_0_0_1.html'}], '武侠同人': [48, {'/all/book/4_16_147_0_3_0_0_0_1.html'}], '女生同人': [112, {'/all/book/4_16_142_0_3_0_0_0_1.html'}], '萌系小说': [82, {'/all/book/4_16_150_0_3_0_0_0_1.html'}], '婆媳关系': [3, {'/all/book/4_26_155_0_3_0_0_0_1.html'}], '灵魂转换': [88, {'/all/book/4_16_151_0_3_0_0_0_1.html'}], '婚恋情感': [1287, {'/all/book/4_26_88_0_3_0_0_0_1.html'}], '授权同人': [63, {'/all/book/4_16_146_0_3_0_0_0_1.html'}], '校园青春': [1222, {'/all/book/4_28_161_0_3_0_0_0_1.html'}], '游戏同人': [163, {'/all/book/4_16_143_0_3_0_0_0_1.html'}], '宅系小说': [130, {'/all/book/4_16_149_0_3_0_0_0_1.html'}], '幻想爆笑': [164, {'/all/book/4_27_158_0_3_0_0_0_1.html'}], '现实经历': [463, {'/all/book/4_25_153_0_3_0_0_0_1.html'}], '纯爱青春': [387, {'/all/book/4_28_162_0_3_0_0_0_1.html'}], '现实爆笑': [64, {'/all/book/4_27_159_0_3_0_0_0_1.html'}], '家庭伦理': [92, {'/all/book/4_26_157_0_3_0_0_0_1.html'}], '灵异奇谈': [993, {'/all/book/4_7_13_0_3_0_0_0_1.html'}], '动漫同人': [842, {'/all/book/4_16_144_0_3_0_0_0_1.html'}], '臆想世界': [313, {'/all/book/4_25_152_0_3_0_0_0_1.html'}], '侦探推理': [422, {'/all/book/4_7_33_0_3_0_0_0_1.html'}], '冷幽默': [28, {'/all/book/4_27_160_0_3_0_0_0_1.html'}], '探险揭秘': [360, {'/all/book/4_7_102_0_3_0_0_0_1.html'}], '悲伤青春': [448, {'/all/book/4_28_163_0_3_0_0_0_1.html'}], '恐怖悬疑': [617, {'/all/book/4_7_28_0_3_0_0_0_1.html'}], '影视同人': [354, {'/all/book/4_16_145_0_3_0_0_0_1.html'}]}, '仙侠武侠': {'历史武侠': [136, {'/all/book/2_24_124_0_3_0_0_0_1.html'}], '古典仙侠': [1448, {'/all/book/2_24_9_0_3_0_0_0_1.html'}], '国术古武': [33, {'/all/book/2_24_125_0_3_0_0_0_1.html'}], '现代修真': [400, {'/all/book/2_24_81_0_3_0_0_0_1.html'}], '现代异侠': [64, {'/all/book/2_24_96_0_3_0_0_0_1.html'}], '传统武侠': [1073, {'/all/book/2_24_2_0_3_0_0_0_1.html'}], '洪荒封神': [208, {'/all/book/2_24_85_0_3_0_0_0_1.html'}], '奇幻修真': [995, {'/all/book/2_24_82_0_3_0_0_0_1.html'}]}}
